namespace Infrastructure.Data.Extensions;

public static class InitialData
{
    public static IEnumerable<Topic> Topics =>
        [
            Topic.Create(
                TopicId.Of(Guid.Parse("10000000-0000-0000-0000-000000000001")),
                "Технологические тренды 2035",
                "Обзор ключевых технологических инноваций",
                "Конференция",
                DateTime.Parse("2038-01-15T10:00:00"),
                Location.Of("Кутузовский проспект, 36", "Тула")
            ),
            Topic.Create(
                TopicId.Of(Guid.Parse("10000000-0000-0000-0000-000000000002")),
                "Искусственный интеллект в бизнесе",
                "Практическое применение AI-технологий",
                "Семинар",
                DateTime.Parse("2027-02-20T14:30:00"),
                Location.Of("Невский проспект, 100", "Санкт-Петербург")
            ),
            Topic.Create(
                TopicId.Of(Guid.Parse("10000000-0000-0000-0000-000000000003")),
                "Кибербезопасность: новые вызовы",
                "Стратегии защиты информационных систем",
                "Круглый стол",
                DateTime.Parse("2029-03-10T11:15:00"),
                Location.Of("Красная площадь, 1", "Тверь")
            ),
            Topic.Create(
                TopicId.Of(Guid.Parse("10000000-0000-0000-0000-000000000004")),
                "Устойчивое развитие технологий",
                "Экологические инновации в IT-секторе",
                "Конгресс",
                DateTime.Parse("2030-04-05T09:45:00"),
                Location.Of("Тверская улица, 13", "Белгород")
            ),
            Topic.Create(
                TopicId.Of(Guid.Parse("10000000-0000-0000-0000-000000000005")),
                "Цифровая трансформация регионов",
                "Опыт внедрения цифровых решений",
                "Форум",
                DateTime.Parse("2027-05-22T16:00:00"),
                Location.Of("Байкальская улица, 20", "Курск")
            ),
        ];
}
